Repository: Devansh1312/Invoice
Catalog: Invoice/locale/*/LC_MESSAGES/django.po
Languages: ar

source: FAQ retrieved successfully.
ar: تم استرداد الأسئلة الشائعة بنجاح.

source: All fields are required.
ar: جميع الحقول مطلوبة.

source: Invalid email format.
ar: تنسيق البريد الإلكتروني غير صالح.

source: Email already in use.
ar: البريد الإلكتروني مستخدم بالفعل.

source: Phone number already in use.
ar: رقم الهاتف مستخدم بالفعل.

source: Your Verification OTP
ar: رمز التحقق الخاص بك

source: Failed to send OTP email.
ar: فشل إرسال رسالة رمز التحقق.

source: OTP sent successfully.
ar: تم إرسال رمز التحقق بنجاح.

source: Email is required.
ar: البريد الإلكتروني مطلوب.

source: Invalid registration type.
ar: نوع التسجيل غير صالح.

source: An error occurred during registration.
ar: حدث خطأ أثناء التسجيل.

source: Email and OTP are required.
ar: البريد الإلكتروني ورمز التحقق مطلوبان.

source: Invalid OTP or email.
ar: رمز التحقق أو البريد الإلكتروني غير صالح.

source: Registration successful.
ar: تم التسجيل بنجاح.

source: Email and password are required.
ar: البريد الإلكتروني وكلمة المرور مطلوبان.

source: Invalid credentials.
ar: بيانات الاعتماد غير صالحة.

source: Account is not active.
ar: الحساب غير نشط.

source: Login successful.
ar: تم تسجيل الدخول بنجاح.

source: Email not registered.
ar: البريد الإلكتروني غير مسجل.

source: Invalid login type.
ar: نوع تسجيل الدخول غير صالح.

source: An error occurred during login.
ar: حدث خطأ أثناء تسجيل الدخول.

source: Refresh token is required.
ar: رمز التحديث مطلوب.

source: Successfully logged out.
ar: تم تسجيل الخروج بنجاح.

source: Error during logout.
ar: حدث خطأ أثناء تسجيل الخروج.

source: Reasons fetched successfully.
ar: تم جلب الأسباب بنجاح.

source: Invalid deletion reason ID. It must be an integer.
ar: معرف سبب الحذف غير صالح. يجب أن يكون رقماً صحيحاً.

source: Invalid deletion reason ID.
ar: معرف سبب الحذف غير صالح.

source: Your account has been deleted successfully.
ar: تم حذف حسابك بنجاح.

source: Profile retrieved successfully.
ar: تم استرداد الملف الشخصي بنجاح.

source: An error occurred while retrieving profile.
ar: حدث خطأ أثناء استرداد الملف الشخصي.

source: The following fields are required: %s
ar: الحقول التالية مطلوبة: %s

source: This email is already registered with another account.
ar: هذا البريد الإلكتروني مسجل بالفعل بحساب آخر.

source: Profile updated successfully.
ar: تم تحديث الملف الشخصي بنجاح.

source: An error occurred while updating profile.
ar: حدث خطأ أثناء تحديث الملف الشخصي.

source: No profile picture provided.
ar: لم يتم توفير صورة للملف الشخصي.

source: Profile Picture updated successfully.
ar: تم تحديث صورة الملف الشخصي بنجاح.

source: Old password is incorrect.
ar: كلمة المرور القديمة غير صحيحة.

source: New password must be at least 8 characters long.
ar: يجب أن تتكون كلمة المرور الجديدة من 8 أحرف على الأقل.

source: Password changed successfully.
ar: تم تغيير كلمة المرور بنجاح.

source: Email address is required.
ar: عنوان البريد الإلكتروني مطلوب.

source: System configuration error. Please contact support.
ar: خطأ في تكوين النظام. يرجى الاتصال بالدعم.

source: Your Reset Password Verification Code
ar: رمز التحقق لإعادة تعيين كلمة المرور الخاص بك

source: We encountered an issue while sending your OTP email. Please try again.
ar: واجهنا مشكلة أثناء إرسال رسالة رمز التحقق. يرجى المحاولة مرة أخرى.

source: A verification code has been sent to your email address. Please check your inbox.
ar: تم إرسال رمز تحقق إلى عنوان بريدك الإلكتروني. يرجى التحقق من صندوق الوارد.

source: We were unable to send the verification email. Please try again later.
ar: تعذر إرسال رسالة التحقق. يرجى المحاولة مرة أخرى لاحقاً.

source: No registered account found with this email address.
ar: لم يتم العثور على حساب مسجل بهذا العنوان الإلكتروني.

source: Both email and OTP are required.
ar: كل من البريد الإلكتروني ورمز التحقق مطلوبان.

source: No OTP generated for this email.
ar: لم يتم إنشاء رمز تحقق لهذا البريد الإلكتروني.

source: Invalid OTP.
ar: رمز تحقق غير صالح.

source: OTP has expired. Please request a new one.
ar: انتهت صلاحية رمز التحقق. يرجى طلب رمز جديد.

source: OTP verified successfully.
ar: تم التحقق من رمز التحقق بنجاح.

source: No user found with this email.
ar: لم يتم العثور على مستخدم بهذا البريد الإلكتروني.

source: Email, OTP and new password are all required.
ar: البريد الإلكتروني ورمز التحقق وكلمة المرور الجديدة كلها مطلوبة.

source: Password has been reset successfully.
ar: تم إعادة تعيين كلمة المرور بنجاح.

source: Invalid or missing current_language. It must be either "en" or "ar".
ar: اللغة الحالية غير صالحة أو مفقودة. يجب أن تكون "en" أو "ar".

source: Current language updated successfully.
ar: تم تحديث اللغة الحالية بنجاح.

source: Invalid value for notification preference. Use 0 (off) or 1 (on).
ar: قيمة غير صالحة لتفضيل الإشعارات. استخدم 0 (إيقاف) أو 1 (تشغيل).

source: Notification preference updated successfully.
ar: تم تحديث تفضيل الإشعارات بنجاح.

source: Failed to update notification preference.
ar: فشل تحديث تفضيل الإشعارات.

source: AppLike Feature Dropdown retrieved successfully.
ar: تم استرداد قائمة ميزات التطبيق بنجاح.

source: Rating is required.
ar: التقييم مطلوب.

source: Rating must be between 1 and 5.
ar: يجب أن يكون التقييم بين 1 و 5.

source: Invalid rating format.
ar: تنسيق تقييم غير صالح.

source: Invalid app features selected: %s
ar: ميزات تطبيق غير صالحة محددة: %s

source: Invalid app features format.
ar: تنسيق ميزات التطبيق غير صالح.

source: Review submitted successfully.
ar: تم إرسال المراجعة بنجاح.

source: Failed to submit review.
ar: فشل إرسال المراجعة.

source: Subscription plans retrieved successfully.
ar: تم استرداد خطط الاشتراك بنجاح.

source: Invalid subscription plan.
ar: خطة اشتراك غير صالحة.

source: Subscription purchased successfully.
ar: تم شراء الاشتراك بنجاح.

source: Subscription renewed successfully.
ar: تم تجديد الاشتراك بنجاح.

source: Subscription upgraded successfully.
ar: تم ترقية الاشتراك بنجاح.

source: No active subscription found.
ar: لم يتم العثور على اشتراك نشط.

source: Active subscription retrieved successfully.
ar: تم استرداد الاشتراك النشط بنجاح.

source: Chat messages retrieved successfully.
ar: تم استرداد رسائل الدردشة بنجاح.

source: No chat session found.
ar: لم يتم العثور على جلسة دردشة.

source: Message content is required.
ar: محتوى الرسالة مطلوب.

source: Message sent to admin successfully.
ar: تم إرسال الرسالة إلى المسؤول بنجاح.

source: URL is required.
ar: الرابط مطلوب.

source: Invalid URL format.
ar: تنسيق الرابط غير صالح.

source: URL has already been checked (cached results).
ar: تم التحقق من الرابط مسبقًا (النتائج مخزنة مؤقتًا).

source: You have used all allowed URLs in your subscription. Please upgrade your plan.
ar: لقد استخدمت جميع الروابط المسموح بها في اشتراكك. يرجى ترقية خطتك.

source: You have used all free URL checks. Please subscribe to continue.
ar: لقد استخدمت جميع فحوصات الروابط المجانية. يرجى الاشتراك للمتابعة.

source: Safe Browsing API key is not configured.
ar: مفتاح واجهة برمجة التطبيقات لتصفح الآمن غير مُهيأ.

source: URL checked successfully.
ar: تم التحقق من الرابط بنجاح.

source: An error occurred while checking the URL.
ar: حدث خطأ أثناء التحقق من الرابط.

source: Secure
ar: آمن

source: Moderate
ar: متوسط

source: Unsecured
ar: غير آمن

source: Error
ar: خطأ

source: SSL connection failed
ar: فشل الاتصال بشهادة SSL

source: Valid
ar: صالح

source: Invalid
ar: غير صالح

source: Unknown
ar: غير معروف

source: Safe to Use.
ar: آمن للاستخدام.

source: Moderate Risk
ar: مخاطرة متوسطة

source: Dangerous to Use.
ar: خطر للاستخدام.

source: Very new domain (less than 30 days old). Exercise caution.
ar: نطاق جديد جدًا (أقل من 30 يومًا). يُرجى توخي الحذر.

source: Relatively new domain (less than 90 days old). Some caution advised.
ar: نطاق جديد نسبيًا (أقل من 90 يومًا). يُنصح ببعض الحذر.

source: Domain has been registered for less than a year.
ar: تم تسجيل النطاق منذ أقل من عام.

source: Well-established domain (registered for %s years).
ar: نطاق موثوق (مسجل منذ %s سنوات).

source: Well-established domain (registered for 1 year).
ar: نطاق موثوق (مسجل منذ سنة واحدة).

source: Well-established domain.
ar: نطاق موثوق.

source: No historical data available
ar: لا توجد بيانات تاريخية متاحة

source: Security threats detected by Google Safe Browsing
ar: تم اكتشاف تهديدات أمنية بواسطة Google Safe Browsing

source: Invalid or missing SSL certificate
ar: شهادة SSL غير صالحة أو مفقودة

source: SSL verification issues
ar: مشاكل في التحقق من شهادة SSL

source: SSL certificate expiring very soon (%s days)
ar: ستنتهي صلاحية شهادة SSL قريبًا جدًا (%s يومًا)

source: SSL certificate expiring within a month (%s days)
ar: ستنتهي صلاحية شهادة SSL خلال شهر (%s يومًا)

source: Very new domain (less than 30 days old)
ar: نطاق جديد جدًا (أقل من 30 يومًا)

source: Relatively new domain (less than 90 days old)
ar: نطاق جديد نسبيًا (أقل من 90 يومًا)

source: Well-established domain with valid security
ar: نطاق موثوق بأمان صالح

source: Valid SSL certificate
ar: شهادة SSL صالحة

source: Mixed security signals
ar: إشارات أمان مختلطة

source: URL contains IP address instead of domain name
ar: يحتوي الرابط على عنوان IP بدلاً من اسم نطاق

source: Unusually long domain name
ar: اسم نطاق طويل بشكل غير معتاد

source: URL contains potential phishing patterns
ar: يحتوي الرابط على أنماط تصيد احتيالي محتملة

source: Unusual number of subdomains (%s)
ar: عدد غير معتاد من النطاقات الفرعية (%s)

source: Domain uses potentially suspicious TLD
ar: يستخدم النطاق لاحقة نطاق مشبوهة محتملة

source: Unknown (API error)
ar: غير معروف (خطأ في واجهة برمجة التطبيقات)

source: Safe
ar: آمن

source: Unsafe
ar: غير آمن

source: Dangerous to Use - Possible Phishing Site
ar: خطر للاستخدام - موقع تصيد احتيالي محتمل

source: URL Marked as Safe.
ar: تم تصنيف الرابط على أنه آمن.

source: URL Marked as Unsafe.
ar: تم تصنيف الرابط على أنه غير آمن.

source: Invalid action. Use 1 for safe and 0 for unsafe.
ar: إجراء غير صالح. استخدم 1 للآمن و0 لغير الآمن.

source: URL record not found.
ar: لم يتم العثور على سجل الرابط.

source: An error occurred while updating the URL record.
ar: حدث خطأ أثناء تحديث سجل الرابط.

source: URL statistics retrieved successfully
ar: تم جلب إحصائيات الرابط بنجاح.

source: An error occurred while fetching URL statistics
ar: حدث خطأ أثناء جلب إحصائيات الرابط.

source: Invalid type. Use 1 for safe and 0 for unsafe.
ar: نوع غير صالح. استخدم 1 للآمن و0 لغير الآمن.

source: No information available
ar: لا توجد معلومات متاحة.

source: No recommendation
ar: لا توجد توصية.

source: An error occurred while fetching URL history
ar: حدث خطأ أثناء جلب سجل الرابط.

source: An error occurred while fetching notification history
ar: حدث خطأ أثناء جلب سجل الإشعارات.

source: Notification deleted successfully
ar: تم حذف الإشعار بنجاح.

source: Notification not found
ar: لم يتم العثور على الإشعار.

source: An error occurred while deleting the notification
ar: حدث خطأ أثناء حذف الإشعار.

source: All notifications deleted successfully
ar: تم حذف جميع الإشعارات بنجاح.

source: An error occurred while deleting the notifications
ar: حدث خطأ أثناء حذف الإشعارات.

source: Password Reset Verification Code
ar: رمز التحقق لإعادة تعيين كلمة المرور

source: Your password reset verification code is: %(otp)s
ar: رمز التحقق لإعادة تعيين كلمة المرور الخاصة بك هو: %(otp)s

source: Failed to send password reset verification email.
ar: فشل إرسال رسالة تحقق لإعادة تعيين كلمة المرور.

source: Password reset verification email sent successfully.
ar: تم إرسال رسالة تحقق لإعادة تعيين كلمة المرور بنجاح.

source: Valid (Expiring Soon)
ar: صالح (ستنتهي قريبا)

source: Free URL checks are not available for users who previously had subscriptions. Please renew your subscription.
ar: لا تتوفر فحوصات روابط مجانية للمستخدمين الذين كانوا قد امتلكوا اشتراكات سابقة. يرجى تجديد اشتراكك.
